{
	"dividing-by-0": {
		"pD": "before Aug 28, 2021",
		"fT": "html",
		"pC": "<div class=\"notice\">This post is not fact, the word problems are wrong, and it would never be x*0, rather, it would be 0*x<\/div>So, lets say you own a hotel(just go along with it).<p>You have 2 rooms, and 0 people, if each room gets an equal amount of people(not including decimals, you can't have half, or a quarter of a person without them being dead)<div>common sense would tell you that you need that there would be 0 people in each room, right? Wrong, and now ever mathematician in the world will hunt you down.</div>Wait, if that's not correct, what is the right answer? Thanks for asking... me. The answer is, infinity... but why?</p>Well, according to the mathematicians, it's because you can fit infinite 0s of people into 1 room.<div>It's weird... I know. So why don't we correct this? Because the mathematicians decided that x/0=infinity... and ifyou know one, you'd know that they don't really like to be corrected. But we can still correct, we just need to get the current mathematician out of their seats... hm...</div>"
	},
	"How-to-copy-and-paste-on-mobile": {
		"pD": "before Aug 28, 2021",
		"fT": "html",
		"pC": "Recently, I've been seeing a lot of people coming up with one excuse for not linking the dupelicate topic in the suggestions forum. They say something like,<div style=\"background-color: #979797; text-align: right; padding: 3px;\">I'm on mobile!!!!! 😖😭😫<\/div>this is not a correct argument, so I've decided to make this post to prove it.<h1>Safari\/iOS<\/h1>the way that you copy and paste on Safari is by double taping on the text, then dragging until you've selected all the text<span style=\"color: #FF0000;\">(the next bit works for links, not this)<\/span><h2>Coping links<\/h2>tap and hold on the link until you see:<img src=\"https:\/\/i.ibb.co\/9cYsfcP\/IMG-5938.jpg\" alt=\"open, open in background, open in new window, download link file, add to reading list, *copy*, share\" border=\"0\" width=\"130\" height=\"105\"><h2>Paste<\/h2>going to any textbox, in the top-left-hand conner, you should see a little clipboard icon(as long as you aren't selecting any text), press it. tap \"copy(circled in <span style=\"color: #FF0000;\">red<\/span>)\"<div style=\"background-color: #ff0004; color: #00FFFF; text-align: center;\">🏷Note: I don't own an android tablet or phone, so take this with a grain of salt<\/div><h1>Chrome\/Android<\/h1>press and hold until a few selection boxes come up(might work for links)<h2>pasting<\/h2>tap and hold int the text box, you should see \"paste,\" now click that(boxed in <span style=\"color: #FF0000;\">:<img src=\"https:\/\/u.cubeupload.com\/Steve_Greatness\/Screenshot2021050571.png\" width=\"300\" height=\"60\"><span style=\"font-size: 10px;\"><a href=\"https:\/\/www.businessinsider.com\/how-to-copy-and-paste-on-android?op=1\">Image Source<\/a><\/span>"
	},
	"How-To-make-mockups": {
		"pD": "before Aug 28, 2021",
		"fT": "html",
		"pC": "The first step to making a mockup is to open up the inpect menu, you may be able to do this using <t>ctrl+shift+i<\/t>(or <t>f12<\/t>)<div class=\"Notice\">this will be different from browser to browser.<\/div>once you see inspect element open, simply go to the page you're making a mockup for(ex. <a href=\"https:\/\/Scratch.mit.edu\/mystuff\">MyStuff<\/a>; or if you're making a new page, go to the page that looks the closest.), and press <t>ctrl+shift+c<\/t>, and click on the area that you want to change(ex. the <t>+ New Project<\/t> button.<p>now that you've selected the element, let's learn how to edit it! You should see the element that you clicked on(using the <t>ctrl+shift+c<\/t> command) highlighted in blue. Inside of the element(if you selected text, or even an image), you should see a darker area, that isn't red, <t>double click<\/t> on it, it should now be hilighted, now type in whatever you want(if it's an image, make sure to put in an image link, ex. https:\/\/imagehoster.com\/png\/png.png; if you clicked on a link(in the \"\" in \"a href=''\", unselect it and select the part \"<a href='link'>\"here\"<\/a>\").<\/p>anyways... if you don't have the monna lisa yet, just give up \/s"
	},
	"Why-inspect-element-is-a-useful-tool": {
		"pD": "before Aug 28, 2021",
		"fT": "html",
		"pC": "So, as of currently, my <a href=\"https:\/\/ocular.jeffalo.net\/user\/Steve0Greatness\">Ocular Status<\/a> is <span style=\"font-style: italic; color: #0dbfb7; background-color: #0f0f0f;\">Mobile needs a better browser! #MobileSmartBrowser! (Er\/Him)<\/span>. Part of the reason for this is so that inspect can be on mobile.<p>but what makes inspect so important?<\/p>Well I'm glad I asked!<div>So on GitHub, you only have 2000 actions you can do(on the free plan). So that means you need to use them carefully, make sure that you won't do something that wastes an action.<\/div>It helps you fix any mistake, before you make anymore. <div>Of course, you can always download the file, and edit it offline. But inspect element is easier, live, and requires less space in your hard-drive.<\/div>Thanks for coming to my Ted-talk.😜🤪"
	},
	"What-about-the-second-site?": {
		"pD": "Sep 1, 2021",
		"fT": "html",
		"pC": "So you may know about <a href=\"https:\/\/stevesgreatness.repl.co\">StevesGreatness.Repl.Co<\/a>, or, the second site.<br>It contains more than what this one does, but also less. It doesn't have a blog, information about my alts on Scratch, or even addition projects. However, it does have a page for testing, an about me, a list of my accounts on other sites, and a list of my repls(which I want to eventually turn into a list of my repos, and Scratch projects as well)."
	},
	"Changing_the_Dark-mode": {
		"pD": "Sep 11, 2021",
		"fT": "html",
		"pC": "As of currently, the light mode on this site doesn't live up to what I want it to be.<br>I want it to be something that is the opposite of the dark mode, and it really isn't that. Expect it to change. But, in case you do still want to view it, here are the current css variable colors:<br><pre><code>html.l {--navCo: #0F0089;--headCo: #3700FF;--linkCo: #F7E45D;--maCo: #0044F7;--maTxtCo: #C2FFBA;--buCo: #F09;--buTxtCo: #0FF;--buBoCo: #fff;--noteCo: #f25;--noteTxtCo: #ccc;--inCo: #0bf;--inlinkCo: #05c;--selCo: #f51;--selTxtCo: #059;<br>--taCo: #cf4;--taTxtCo: black;}</code></pre>"
	}
}